In [2]:
import pandas as pd
pd.read_csv("../data/Teams.csv")

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
0,1871,NaN,BS1,BNA,NaN,3,31,NaN,20,10,...,NaN,0.830,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NaN,CH1,CNA,NaN,2,28,NaN,19,9,...,NaN,0.820,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NaN,CL1,CFC,NaN,8,29,NaN,10,19,...,NaN,0.810,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NaN,FW1,KEK,NaN,7,19,NaN,7,12,...,NaN,0.800,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NaN,NY2,NNA,NaN,5,33,NaN,16,17,...,NaN,0.830,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2800,2015,NL,LAN,LAD,W,1,162,81.0,92,70,...,133.0,0.988,Los Angeles Dodgers,Dodger Stadium,3764815.0,101,98,LAD,LAN,LAN
2801,2015,NL,SFN,SFG,W,2,162,81.0,84,78,...,145.0,0.987,San Francisco Giants,AT&T Park,3375882.0,99,97,SFG,SFN,SFN
2802,2015,NL,ARI,ARI,W,3,162,81.0,79,83,...,146.0,0.986,Arizona Diamondbacks,Chase Field,2080145.0,107,106,ARI,ARI,ARI
2803,2015,NL,SDN,SDP,W,4,162,81.0,74,88,...,138.0,0.985,San Diego Padres,Petco Park,2459742.0,98,97,SDP,SDN,SDN
2804,2015,NL,COL,COL,W,5,162,81.0,68,94,...,171.0,0.985,Colorado Rockies,Coors Field,2506789.0,119,118,COL,COL,COL

In [15]:
Tdf = pd.read_csv("../data/Teams.csv", encoding= 'utf-8')
Tdf.tail(2)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
2803,2015,NL,SDN,SDP,W,4,162,81.0,74,88,...,138.0,0.985,San Diego Padres,Petco Park,2459742.0,98,97,SDP,SDN,SDN
2804,2015,NL,COL,COL,W,5,162,81.0,68,94,...,171.0,0.985,Colorado Rockies,Coors Field,2506789.0,119,118,COL,COL,COL

In [ ]:
### Dropping the columns I am uninterested in

In [12]:
Tdf = Tdf.drop(['lgID','franchID', 'divID', 'Rank', 'DivWin','WCWin','AB','2B','3B','HR','SO','SB','CS','HBP'
             ,'SF','RA','ER','ERA','CG','SHO','SV','IPouts','HA','HRA','BBA','SOA','DP','FP','name','park'
              , 'BPF','PPF','teamIDBR','teamIDlahman45','teamIDretro','BB', 'Ghome'], axis = 1)
Tdf.tail(2)

      yearID teamID    G  Ghome   W   L LgWin WSWin    R     H   E  attendance
2803    2015    SDN  162   81.0  74  88     N     N  650  1324  92   2459742.0
2804    2015    COL  162   81.0  68  94     N     N  737  1479  95   2506789.0

In [ ]:
### Getting rid of any rows with "NaN" values.

In [27]:
Tdf = Tdf.dropna(axis = 'rows');
print(Tdf[Tdf.isna().any(axis=1)])

Empty DataFrame
Columns: [LoanRange, BusinessName, Address, City, State, Zip, BusinessType, JobsRetained, Lender]
Index: []

In [13]:
Tdf.tail(3)

      yearID teamID    G  Ghome   W   L LgWin WSWin    R     H   E  attendance
2802    2015    ARI  162   81.0  79  83     N     N  720  1494  86   2080145.0
2803    2015    SDN  162   81.0  74  88     N     N  650  1324  92   2459742.0
2804    2015    COL  162   81.0  68  94     N     N  737  1479  95   2506789.0

In [ ]:
### Checking to make sure I am left with enough rows

In [14]:
index = Tdf.index
number_of_rows = len(index)
print(number_of_rows)

2805

In [20]:
Tdf.tail(1)

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
2804,2015,NL,COL,COL,W,5,162,81.0,68,94,...,171.0,0.985,Colorado Rockies,Coors Field,2506789.0,119,118,COL,COL,COL

In [17]:
Tdf.to_csv("../data/Clean_Teams_Data.csv")